---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.RoomFilter
source: html/c6b70b28-884a-7bf6-9be4-75251605f633.htm
---
# RoomFilter Members

Constructs a filter which matches only rooms.